{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "stem_conv1", "class_name": "Conv2D", "config": {"name": "stem_conv1", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "stem_bn1", "class_name": "BatchNormalization", "config": {"name": "stem_bn1", "trainable": true, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["stem_conv1", 0, 0, {}]]]}, {"name": "activation_261", "class_name": "Activation", "config": {"name": "activation_261", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]]}, {"name": "reduction_conv_1_stem_1", "class_name": "Conv2D", "config": {"name": "reduction_conv_1_stem_1", "trainable": true, "filters": 11, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_261", 0, 0, {}]]]}, {"name": "reduction_bn_1_stem_1", "class_name": "BatchNormalization", "config": {"name": "reduction_bn_1_stem_1", "trainable": true, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["reduction_conv_1_stem_1", 0, 0, {}]]]}, {"name": "activation_262", "class_name": "Activation", "config": {"name": "activation_262", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["reduction_bn_1_stem_1", 0, 0, {}]]]}, {"name": "activation_264", "class_name": "Activation", "config": {"name": "activation_264", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]]}, {"name": "separable_conv_1_pad_reduction_left1_stem_1", "class_name": "ZeroPadding2D", "config": {"name": "separable_conv_1_pad_reduction_left1_stem_1", "trainable": true, "padding": [[2, 2], [2, 2]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_262", 0, 0, {}]]]}, {"name": "separable_conv_1_pad_reduction_right1_stem_1", "class_name": "ZeroPadding2D", "config": {"name": "separable_conv_1_pad_reduction_right1_stem_1", "trainable": true, "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_264", 0, 0, {}]]]}, {"name": "separable_conv_1_reduction_left1_stem_1", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_left1_stem_1", "trainable": true, "filters": 11, "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["separable_conv_1_pad_reduction_left1_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_1_reduction_right1_stem_1", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_right1_stem_1", "trainable": true, "filters": 11, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["separable_conv_1_pad_reduction_right1_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_1_bn_reduction_left1_stem_1", "class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_left1_stem_1", "trainable": true, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_1_reduction_left1_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_1_bn_reduction_right1_stem_1", "class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_right1_stem_1", "trainable": true, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_1_reduction_right1_stem_1", 0, 0, {}]]]}, {"name": "activation_263", "class_name": "Activation", "config": {"name": "activation_263", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_left1_stem_1", 0, 0, {}]]]}, {"name": "activation_265", "class_name": "Activation", "config": {"name": "activation_265", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_right1_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_2_reduction_left1_stem_1", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_2_reduction_left1_stem_1", "trainable": true, "filters": 11, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["activation_263", 0, 0, {}]]]}, {"name": "separable_conv_2_reduction_right1_stem_1", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_2_reduction_right1_stem_1", "trainable": true, "filters": 11, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["activation_265", 0, 0, {}]]]}, {"name": "activation_266", "class_name": "Activation", "config": {"name": "activation_266", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]]}, {"name": "separable_conv_2_bn_reduction_left1_stem_1", "class_name": "BatchNormalization", "config": {"name": "separable_conv_2_bn_reduction_left1_stem_1", "trainable": true, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_2_reduction_left1_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_2_bn_reduction_right1_stem_1", "class_name": "BatchNormalization", "config": {"name": "separable_conv_2_bn_reduction_right1_stem_1", "trainable": true, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_2_reduction_right1_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_1_pad_reduction_right2_stem_1", "class_name": "ZeroPadding2D", "config": {"name": "separable_conv_1_pad_reduction_right2_stem_1", "trainable": true, "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_266", 0, 0, {}]]]}, {"name": "activation_268", "class_name": "Activation", "config": {"name": "activation_268", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]]}, {"name": "reduction_add_1_stem_1", "class_name": "Add", "config": {"name": "reduction_add_1_stem_1", "trainable": true}, "inbound_nodes": [[["separable_conv_2_bn_reduction_left1_stem_1", 0, 0, {}], ["separable_conv_2_bn_reduction_right1_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_1_reduction_right2_stem_1", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_right2_stem_1", "trainable": true, "filters": 11, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["separable_conv_1_pad_reduction_right2_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_1_pad_reduction_right3_stem_1", "class_name": "ZeroPadding2D", "config": {"name": "separable_conv_1_pad_reduction_right3_stem_1", "trainable": true, "padding": [[2, 2], [2, 2]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_268", 0, 0, {}]]]}, {"name": "activation_270", "class_name": "Activation", "config": {"name": "activation_270", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["reduction_add_1_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_1_bn_reduction_right2_stem_1", "class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_right2_stem_1", "trainable": true, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_1_reduction_right2_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_1_reduction_right3_stem_1", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_right3_stem_1", "trainable": true, "filters": 11, "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["separable_conv_1_pad_reduction_right3_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_1_reduction_left4_stem_1", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_left4_stem_1", "trainable": true, "filters": 11, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["activation_270", 0, 0, {}]]]}, {"name": "activation_267", "class_name": "Activation", "config": {"name": "activation_267", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_right2_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_1_bn_reduction_right3_stem_1", "class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_right3_stem_1", "trainable": true, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_1_reduction_right3_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_1_bn_reduction_left4_stem_1", "class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_left4_stem_1", "trainable": true, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_1_reduction_left4_stem_1", 0, 0, {}]]]}, {"name": "reduction_pad_1_stem_1", "class_name": "ZeroPadding2D", "config": {"name": "reduction_pad_1_stem_1", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["reduction_bn_1_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_2_reduction_right2_stem_1", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_2_reduction_right2_stem_1", "trainable": true, "filters": 11, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["activation_267", 0, 0, {}]]]}, {"name": "activation_269", "class_name": "Activation", "config": {"name": "activation_269", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_right3_stem_1", 0, 0, {}]]]}, {"name": "activation_271", "class_name": "Activation", "config": {"name": "activation_271", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_left4_stem_1", 0, 0, {}]]]}, {"name": "reduction_left2_stem_1", "class_name": "MaxPooling2D", "config": {"name": "reduction_left2_stem_1", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["reduction_pad_1_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_2_bn_reduction_right2_stem_1", "class_name": "BatchNormalization", "config": {"name": "separable_conv_2_bn_reduction_right2_stem_1", "trainable": true, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_2_reduction_right2_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_2_reduction_right3_stem_1", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_2_reduction_right3_stem_1", "trainable": true, "filters": 11, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["activation_269", 0, 0, {}]]]}, {"name": "separable_conv_2_reduction_left4_stem_1", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_2_reduction_left4_stem_1", "trainable": true, "filters": 11, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["activation_271", 0, 0, {}]]]}, {"name": "adjust_relu_1_stem_2", "class_name": "Activation", "config": {"name": "adjust_relu_1_stem_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]]}, {"name": "reduction_add_2_stem_1", "class_name": "Add", "config": {"name": "reduction_add_2_stem_1", "trainable": true}, "inbound_nodes": [[["reduction_left2_stem_1", 0, 0, {}], ["separable_conv_2_bn_reduction_right2_stem_1", 0, 0, {}]]]}, {"name": "reduction_left3_stem_1", "class_name": "AveragePooling2D", "config": {"name": "reduction_left3_stem_1", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["reduction_pad_1_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_2_bn_reduction_right3_stem_1", "class_name": "BatchNormalization", "config": {"name": "separable_conv_2_bn_reduction_right3_stem_1", "trainable": true, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_2_reduction_right3_stem_1", 0, 0, {}]]]}, {"name": "reduction_left4_stem_1", "class_name": "AveragePooling2D", "config": {"name": "reduction_left4_stem_1", "trainable": true, "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["reduction_add_1_stem_1", 0, 0, {}]]]}, {"name": "separable_conv_2_bn_reduction_left4_stem_1", "class_name": "BatchNormalization", "config": {"name": "separable_conv_2_bn_reduction_left4_stem_1", "trainable": true, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_2_reduction_left4_stem_1", 0, 0, {}]]]}, {"name": "reduction_right5_stem_1", "class_name": "MaxPooling2D", "config": {"name": "reduction_right5_stem_1", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["reduction_pad_1_stem_1", 0, 0, {}]]]}, {"name": "zero_padding2d_5", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_5", "trainable": true, "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["adjust_relu_1_stem_2", 0, 0, {}]]]}, {"name": "reduction_add3_stem_1", "class_name": "Add", "config": {"name": "reduction_add3_stem_1", "trainable": true}, "inbound_nodes": [[["reduction_left3_stem_1", 0, 0, {}], ["separable_conv_2_bn_reduction_right3_stem_1", 0, 0, {}]]]}, {"name": "add_5", "class_name": "Add", "config": {"name": "add_5", "trainable": true}, "inbound_nodes": [[["reduction_add_2_stem_1", 0, 0, {}], ["reduction_left4_stem_1", 0, 0, {}]]]}, {"name": "reduction_add4_stem_1", "class_name": "Add", "config": {"name": "reduction_add4_stem_1", "trainable": true}, "inbound_nodes": [[["separable_conv_2_bn_reduction_left4_stem_1", 0, 0, {}], ["reduction_right5_stem_1", 0, 0, {}]]]}, {"name": "cropping2d_5", "class_name": "Cropping2D", "config": {"name": "cropping2d_5", "trainable": true, "cropping": [[1, 0], [1, 0]], "data_format": "channels_last"}, "inbound_nodes": [[["zero_padding2d_5", 0, 0, {}]]]}, {"name": "reduction_concat_stem_1", "class_name": "Concatenate", "config": {"name": "reduction_concat_stem_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["reduction_add_2_stem_1", 0, 0, {}], ["reduction_add3_stem_1", 0, 0, {}], ["add_5", 0, 0, {}], ["reduction_add4_stem_1", 0, 0, {}]]]}, {"name": "adjust_avg_pool_1_stem_2", "class_name": "AveragePooling2D", "config": {"name": "adjust_avg_pool_1_stem_2", "trainable": true, "pool_size": [1, 1], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["adjust_relu_1_stem_2", 0, 0, {}]]]}, {"name": "adjust_avg_pool_2_stem_2", "class_name": "AveragePooling2D", "config": {"name": "adjust_avg_pool_2_stem_2", "trainable": true, "pool_size": [1, 1], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["cropping2d_5", 0, 0, {}]]]}, {"name": "activation_272", "class_name": "Activation", "config": {"name": "activation_272", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["reduction_concat_stem_1", 0, 0, {}]]]}, {"name": "adjust_conv_1_stem_2", "class_name": "Conv2D", "config": {"name": "adjust_conv_1_stem_2", "trainable": true, "filters": 11, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["adjust_avg_pool_1_stem_2", 0, 0, {}]]]}, {"name": "adjust_conv_2_stem_2", "class_name": "Conv2D", "config": {"name": "adjust_conv_2_stem_2", "trainable": true, "filters": 11, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["adjust_avg_pool_2_stem_2", 0, 0, {}]]]}, {"name": "reduction_conv_1_stem_2", "class_name": "Conv2D", "config": {"name": "reduction_conv_1_stem_2", "trainable": true, "filters": 22, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_272", 0, 0, {}]]]}, {"name": "concatenate_5", "class_name": "Concatenate", "config": {"name": "concatenate_5", "trainable": true, "axis": -1}, "inbound_nodes": [[["adjust_conv_1_stem_2", 0, 0, {}], ["adjust_conv_2_stem_2", 0, 0, {}]]]}, {"name": "reduction_bn_1_stem_2", "class_name": "BatchNormalization", "config": {"name": "reduction_bn_1_stem_2", "trainable": true, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["reduction_conv_1_stem_2", 0, 0, {}]]]}, {"name": "adjust_bn_stem_2", "class_name": "BatchNormalization", "config": {"name": "adjust_bn_stem_2", "trainable": true, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_5", 0, 0, {}]]]}, {"name": "activation_273", "class_name": "Activation", "config": {"name": "activation_273", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["reduction_bn_1_stem_2", 0, 0, {}]]]}, {"name": "activation_275", "class_name": "Activation", "config": {"name": "activation_275", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["adjust_bn_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_1_pad_reduction_left1_stem_2", "class_name": "ZeroPadding2D", "config": {"name": "separable_conv_1_pad_reduction_left1_stem_2", "trainable": true, "padding": [[1, 2], [1, 2]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_273", 0, 0, {}]]]}, {"name": "separable_conv_1_pad_reduction_right1_stem_2", "class_name": "ZeroPadding2D", "config": {"name": "separable_conv_1_pad_reduction_right1_stem_2", "trainable": true, "padding": [[2, 3], [2, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_275", 0, 0, {}]]]}, {"name": "separable_conv_1_reduction_left1_stem_2", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_left1_stem_2", "trainable": true, "filters": 22, "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["separable_conv_1_pad_reduction_left1_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_1_reduction_right1_stem_2", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_right1_stem_2", "trainable": true, "filters": 22, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["separable_conv_1_pad_reduction_right1_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_1_bn_reduction_left1_stem_2", "class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_left1_stem_2", "trainable": true, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_1_reduction_left1_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_1_bn_reduction_right1_stem_2", "class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_right1_stem_2", "trainable": true, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_1_reduction_right1_stem_2", 0, 0, {}]]]}, {"name": "activation_274", "class_name": "Activation", "config": {"name": "activation_274", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_left1_stem_2", 0, 0, {}]]]}, {"name": "activation_276", "class_name": "Activation", "config": {"name": "activation_276", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_right1_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_2_reduction_left1_stem_2", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_2_reduction_left1_stem_2", "trainable": true, "filters": 22, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["activation_274", 0, 0, {}]]]}, {"name": "separable_conv_2_reduction_right1_stem_2", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_2_reduction_right1_stem_2", "trainable": true, "filters": 22, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["activation_276", 0, 0, {}]]]}, {"name": "activation_277", "class_name": "Activation", "config": {"name": "activation_277", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["adjust_bn_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_2_bn_reduction_left1_stem_2", "class_name": "BatchNormalization", "config": {"name": "separable_conv_2_bn_reduction_left1_stem_2", "trainable": true, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_2_reduction_left1_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_2_bn_reduction_right1_stem_2", "class_name": "BatchNormalization", "config": {"name": "separable_conv_2_bn_reduction_right1_stem_2", "trainable": true, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_2_reduction_right1_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_1_pad_reduction_right2_stem_2", "class_name": "ZeroPadding2D", "config": {"name": "separable_conv_1_pad_reduction_right2_stem_2", "trainable": true, "padding": [[2, 3], [2, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_277", 0, 0, {}]]]}, {"name": "activation_279", "class_name": "Activation", "config": {"name": "activation_279", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["adjust_bn_stem_2", 0, 0, {}]]]}, {"name": "reduction_add_1_stem_2", "class_name": "Add", "config": {"name": "reduction_add_1_stem_2", "trainable": true}, "inbound_nodes": [[["separable_conv_2_bn_reduction_left1_stem_2", 0, 0, {}], ["separable_conv_2_bn_reduction_right1_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_1_reduction_right2_stem_2", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_right2_stem_2", "trainable": true, "filters": 22, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["separable_conv_1_pad_reduction_right2_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_1_pad_reduction_right3_stem_2", "class_name": "ZeroPadding2D", "config": {"name": "separable_conv_1_pad_reduction_right3_stem_2", "trainable": true, "padding": [[1, 2], [1, 2]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_279", 0, 0, {}]]]}, {"name": "activation_281", "class_name": "Activation", "config": {"name": "activation_281", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["reduction_add_1_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_1_bn_reduction_right2_stem_2", "class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_right2_stem_2", "trainable": true, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_1_reduction_right2_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_1_reduction_right3_stem_2", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_right3_stem_2", "trainable": true, "filters": 22, "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["separable_conv_1_pad_reduction_right3_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_1_reduction_left4_stem_2", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_1_reduction_left4_stem_2", "trainable": true, "filters": 22, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["activation_281", 0, 0, {}]]]}, {"name": "activation_278", "class_name": "Activation", "config": {"name": "activation_278", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_right2_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_1_bn_reduction_right3_stem_2", "class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_right3_stem_2", "trainable": true, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_1_reduction_right3_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_1_bn_reduction_left4_stem_2", "class_name": "BatchNormalization", "config": {"name": "separable_conv_1_bn_reduction_left4_stem_2", "trainable": true, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_1_reduction_left4_stem_2", 0, 0, {}]]]}, {"name": "reduction_pad_1_stem_2", "class_name": "ZeroPadding2D", "config": {"name": "reduction_pad_1_stem_2", "trainable": true, "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["reduction_bn_1_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_2_reduction_right2_stem_2", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_2_reduction_right2_stem_2", "trainable": true, "filters": 22, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["activation_278", 0, 0, {}]]]}, {"name": "activation_280", "class_name": "Activation", "config": {"name": "activation_280", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_right3_stem_2", 0, 0, {}]]]}, {"name": "activation_282", "class_name": "Activation", "config": {"name": "activation_282", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_left4_stem_2", 0, 0, {}]]]}, {"name": "reduction_left2_stem_2", "class_name": "MaxPooling2D", "config": {"name": "reduction_left2_stem_2", "trainable": true, "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["reduction_pad_1_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_2_bn_reduction_right2_stem_2", "class_name": "BatchNormalization", "config": {"name": "separable_conv_2_bn_reduction_right2_stem_2", "trainable": true, "axis": -1, "momentum": 0.9997, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv_2_reduction_right2_stem_2", 0, 0, {}]]]}, {"name": "separable_conv_2_reduction_right3_stem_2", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_2_reduction_right3_stem_2", "trainable": true, "filters": 22, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "inbound_nodes": [[["activation_280", 0, 0, {}]]]}, {"name": "separable_conv_2_reduction_left4_stem_2", "class_name": "SeparableConv2D", "config": {"name": "separable_conv_2_reduction_left4_stem_2", "trainable": true, "filters": 22, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, 